:PROPERTIES:
:ID:       cdf0de7c-cf7c-456f-a12c-b2496359064b
:END:
#+TITLE: Data Mux: JQ, YQ, XQ, Queries, Conversion
#+DESCRIPTION:
#+TAGS:


**** Find examples of docker compose with services that have volumes

Or =tty= and etc...

#+begin_src shell :results output verbatim code :wrap example yaml
# regwhy='' # something something to filter out
regex='/data/ecto'
n=8 # unfortunately brittle
files=$(locate 'docker-compose.yml' | grep $regex | head -n$n)
yq -y '
.services | to_entries[] | select((.value | type == "object"))
| {svc: .key,
   volumes: .value.volumes}' ${files[@]}

# '| select((.value | type == "object"))
# | {svc: .key,
#    volumes: .value.volumes}' ${files[@]}
#+end_src

#+RESULTS:
#+begin_example yaml
svc: fastai
volumes:
  - .:/data/
---
svc: notebook
volumes:
  - .:/data/
---
svc: watcher
volumes:
  - .:/data/
---
svc: jekyll
volumes:
  - .:/data/
---
svc: web
volumes:
  - grafana-storage:/var/lib/grafana
---
svc: db_mongo
volumes:
  - grafana-mongo-db:/data/db
---
svc: elasticsearch
volumes: null
---
svc: logstash
volumes:
  - ./logstash/pipeline/logstash-nginx.config:/usr/share/logstash/pipeline/logstash-nginx.config
  - ./logstash/nginx.log:/home/nginx.log
---
svc: kibana
volumes: null
---
svc: elasticsearch
volumes: null
---
svc: logstash
volumes:
  - ./logstash/pipeline/logstash-nginx.config:/usr/share/logstash/pipeline/logstash-nginx.config
  - ./logstash/nginx.log:/home/nginx.log
---
svc: kibana
volumes: null
---
svc: elasticsearch
volumes: null
---
svc: logstash
volumes:
  - ./logstash/pipeline/logstash-nginx.config:/usr/share/logstash/pipeline/logstash-nginx.config
  - ./logstash/nginx.log:/home/nginx.log
---
svc: kibana
volumes: null
---
svc: elasticsearch
volumes: null
---
svc: logstash
volumes:
  - ./logstash/pipeline/logstash-nginx.config:/usr/share/logstash/pipeline/logstash-nginx.config
  - ./logstash/nginx.log:/home/nginx.log
---
svc: kibana
volumes: null
---
svc: elasticsearch
volumes: null
---
svc: logstash
volumes:
  - ./logstash/pipeline/logstash-nginx.config:/usr/share/logstash/pipeline/logstash-nginx.config
  - ./logstash/nginx.log:/home/nginx.log
---
svc: kibana
volumes: null
---
svc: fake-app
volumes: null
---
svc: zookeeper
volumes: null
---
svc: broker
volumes: null
---
svc: sensu-backend
volumes: null
---
svc: sensu-agent
volumes: null
---
svc: sensu-cli
volumes: null
---
svc: ansible-rulebook
volumes: null
#+end_example


**** Working with Attributes

Specifying =[]= after =.manifest.project[]= causes document separators to be
inserted for =xq -y= output. Annoying if you're not expecting, but useful
otherwise. The =[]= is somewhat of an implicit map.

While also relevant to =jq=, this is more helpful for =xq= to =yq= conversions.
The triple-dash document separators are actually part of the YAML standard
whereas =jq= must know to parse them while maintaining escaped strings.

This first query creates a unified stream where each XML node can be treated as
separate documents, whereas the latter splats everything together. They both
lose their identity as =<project/>= nodes.

#+begin_src sh :dir (identity dc/repo-path) :results output verbatim :wrap example yaml
xq  -y '
    .manifest.project[]
    | select(."@path" != ."@name")' typescript/astro-themes.xml
#+end_src

#+RESULTS:
#+begin_example yaml
'@name': abdllahdev/nimbus-narratives
'@path': algorizr/nimbus-narratives
'@groups': blog,preact,tailwind,typescript,mdx
---
'@name': bywhitepine/astro-minimal-starter
'@path': jaydanurwin/astro-minimal-starter
'@groups': minimal
---
'@name': bywhitepine/cannonball
'@path': littlesticks/cannonball
'@groups': landing-page
---
'@name': bywhitepine/odyssey-theme
'@path': littlesticks/odyssey-theme
'@groups': featured,landing-page
---
'@name': bywhitepine/simple-blog-astro
'@path': littlesticks/simple-blog-astro
'@groups': blog,lit,mdx
---
'@name': Johnkat-Mj/agency-landing-page-astrojs
'@path': Johnkat-Mj/agencex-astro
'@groups': landing-page,tailwind
---
'@name': LaB-CH3/astrobrew
'@path': anthonylan/astrobrew
'@groups': landing-page
#+end_example

Without separators:

#+begin_src sh :dir (identity dc/repo-path) :results output verbatim :wrap example yaml
xq  -y '
    .manifest.project
    | map(select(."@path" != ."@name"))' typescript/astro-themes.xml
#+end_src

#+RESULTS:
#+begin_example yaml
- '@name': abdllahdev/nimbus-narratives
  '@path': algorizr/nimbus-narratives
  '@groups': blog,preact,tailwind,typescript,mdx
- '@name': bywhitepine/astro-minimal-starter
  '@path': jaydanurwin/astro-minimal-starter
  '@groups': minimal
- '@name': bywhitepine/cannonball
  '@path': littlesticks/cannonball
  '@groups': landing-page
- '@name': bywhitepine/odyssey-theme
  '@path': littlesticks/odyssey-theme
  '@groups': featured,landing-page
- '@name': bywhitepine/simple-blog-astro
  '@path': littlesticks/simple-blog-astro
  '@groups': blog,lit,mdx
- '@name': Johnkat-Mj/agency-landing-page-astrojs
  '@path': Johnkat-Mj/agencex-astro
  '@groups': landing-page,tailwind
- '@name': LaB-CH3/astrobrew
  '@path': anthonylan/astrobrew
  '@groups': landing-page
#+end_example



